# Nut Butter Sales (Dot Product Example)

In [6]:
import numpy as np
import pandas as pd

In [9]:
np.random.seed(0)
# Numbers of jars sold
sales_amount = np.random.randint(0,20,size=(6,3))
sales_amount

array([[12, 15,  0],
       [ 3,  3,  7],
       [ 9, 19, 18],
       [ 4,  6, 12],
       [ 1,  6,  7],
       [14, 17,  5]], dtype=int32)

In [10]:
# Creating Weekly Sales Dataframe
weekly_sales = pd.DataFrame(sales_amount,index=["Sat","Sun","Mon","Tues","Wed","Thur"],
                            columns=["Almond Butter","Peanut Butter","Cashew Butter"])
weekly_sales

      Almond Butter  Peanut Butter  Cashew Butter
Sat              12             15              0
Sun               3              3              7
Mon               9             19             18
Tues              4              6             12
Wed               1              6              7
Thur             14             17              5

In [11]:
# Creating Prices array
prices = np.array([12,10,14])
prices

array([12, 10, 14])

In [13]:
# Creating Prices Dataframe
price_df = pd.DataFrame(prices.reshape(1,3),index = ["Price"],
                        columns=["Almond Butter","Peanut Butter","Cashew Butter"])
price_df

       Almond Butter  Peanut Butter  Cashew Butter
Price             12             10             14

In [15]:
# Shape aren't allinged, Let's Transpose
total_sales = price_df.dot(sales_amount.T)
total_sales

         0    1    2    3    4    5
Price  294  164  550  276  170  408

In [16]:
weekly_sales

      Almond Butter  Peanut Butter  Cashew Butter
Sat              12             15              0
Sun               3              3              7
Mon               9             19             18
Tues              4              6             12
Wed               1              6              7
Thur             14             17              5

In [20]:
total_sales.shape,weekly_sales.shape

((1, 6), (6, 3))

In [26]:
total_sales

         0    1    2    3    4    5
Price  294  164  550  276  170  408

In [25]:
weekly_sales["Price ($)"] = total_sales.T.values
weekly_sales

      Almond Butter  Peanut Butter  Cashew Butter  Price ($)
Sat              12             15              0        294
Sun               3              3              7        164
Mon               9             19             18        550
Tues              4              6             12        276
Wed               1              6              7        170
Thur             14             17              5        408

In [37]:
type(weekly_sales),type(total_sales)

(pandas.core.frame.DataFrame, pandas.core.frame.DataFrame)